import { StyleSheet, Text, View } from 'react-native'
import React from 'react'

const About = () => {
  return (
    <view>
        <view>
          <Text> על היחידה</Text>
        </view>

        <view>
            <Text>יחידת אגוז הוקמה בשנת 1995 ונקראה על שמה של סיירת “אגוז” המיתולוגית.
                 היחידה הוקמה על מנת להביא למהפך ביכולות צה”ל מול ארגון הטרור “חיזבאללה”-
                 ולהכריע את האויב בכל מפגש. עד היום “אגוז” מתמחה בלוחמת גרילה – 
                ומביאה את יכולותיה הייחודיות על מנת להכריע כל אויב בכל מקום.
                 תמצית הרוח של אגוז באה לידי ביטוי בסיסמת היחידה:
                 “ארדוף אויביי ואשיגם ולא אשוב עד כלותם”.
               “אגוז” מתמחה בלחימה בטווחים קרובים, בשטח סבוך, בשדאות, הסוואה וכן בלוחמה זעירה 
               – לחימת טווח קצר שבה איכותו ומקצועיותו של הלוחם מהוות את המרכיב העיקרי להצלחתה. 
               היחידה פועלת בכל זמן, בכל זירה ובכל גזרה ותמיד מנצחת!</Text>
        </view>

    </view>
  )
}

export default About

const styles = StyleSheet.create({})
