import { StyleSheet, Text, View } from 'react-native'
import React from 'react'

const About = () => {
  return (
    <view>
        <view>
          <Text style = {style.title}> על היחידה</Text>
        </view>

        <view>
            <Text>יחידת אגוז הוקמה בשנת 1995 ונקראה על שמה של סיירת “אגוז” המיתולוגית.
                 היחידה הוקמה על מנת להביא למהפך ביכולות צה”ל מול ארגון הטרור “חיזבאללה”-
                 ולהכריע את האויב בכל מפגש. עד היום “אגוז” מתמחה בלוחמת גרילה – 
                ומביאה את יכולותיה הייחודיות על מנת להכריע כל אויב בכל מקום.
                 תמצית הרוח של אגוז באה לידי ביטוי בסיסמת היחידה:
                 “ארדוף אויביי ואשיגם ולא אשוב עד כלותם”.
               “אגוז” מתמחה בלחימה בטווחים קרובים, בשטח סבוך, בשדאות, הסוואה וכן בלוחמה זעירה 
               – לחימת טווח קצר שבה איכותו ומקצועיותו של הלוחם מהוות את המרכיב העיקרי להצלחתה. 
               היחידה פועלת בכל זמן, בכל זירה ובכל גזרה ותמיד מנצחת!</Text>
        </view>

        <view>
          <Text style = {style.title}>על העמותה</Text>
        </view>

        <view>
          <Text>
                  עמותת הסיירת הצפונית הוקמה לאחר מלחמת יום הכיפור, מורכבת מבוגרי היחידה והמשפחות השכולות
                 , מטרתה היינו טיפוח היחידה, לוחמיה ובוגריה, והנצחת חללי היחידה.
                 העמותה רשומה במרשם העמותות ועומדת בקריטריונים למנהל תקין
                 , פועלת תחת פיקוח ועדת ביקורת ועל ידי רואה חשבון ועורך דין, מוכרת לצורכי מס על פי סעיף 
                 46. חברי העמותה פועלים בהתנדבות על פי כישוריהם ובזמנם הפרטי. 
                 יעדי העמותה: ליווי היחידה הסדירה ולוחמיה
                 ,דאגה למשתחררים מהיחידה, הנצחת חללי היחידה ושימור קשר בין בוגרי היחידה והיחידה.</Text>
        </view>

    </view>
  )
}

export default About

const styles = StyleSheet.create({
  title:{
    width:'100%',
    height:'60%',
    marginLeft:40,
    marginTop:40,
  },

})
