import "./About.css"

export function About(){
    return(
        <div>
            <h1>  הסיירת הצפונית </h1>
            <p> עמותת הסיירת הצפונית הוקמה לאחר מלחמת יום הכיפור, 
                מורכבת מבוגרי היחידה והמשפחות השכולות. מטרות העמותה הן טיפוח היחידה, לוחמיה ובוגריה, 
                והנצחת חללי היחידה. חברי העמותה פועלים בהתנדבות על פי כישוריהם ובזמנם הפרטי.</p>

            <hi> 1995</hi>
        <p>“אגוז” הוקמה בינואר 1995 על מנת לנצח בכל מפגש מול חיזבאללה
            , תוך זמן קצר לוחמי היחידה החלו לקצור הצלחות
            . הכרעה בכל היתקלות ושינוי מאזן הכוחות בדרום לבנון
            . “ארדוף אויבי ואשיגם ולא אשוב עד כלותם…”</p>
        </div>

       
    );
}

