import "./About.css"

export function About(){
    return(
        <div>
            <h1>  הסיירת הצפונית </h1>
            <p> עמותת הסיירת הצפונית הוקמה לאחר מלחמת יום הכיפור, 
                מורכבת מבוגרי היחידה והמשפחות השכולות. מטרות העמותה הן טיפוח היחידה, לוחמיה ובוגריה, 
                והנצחת חללי היחידה. חברי העמותה פועלים בהתנדבות על פי כישוריהם ובזמנם הפרטי.</p>

            <hi> 1995</hi>
            <h2>הקמת יחידת אגוז</h2>
        <p>“אגוז” הוקמה בינואר 1995 על מנת לנצח בכל מפגש מול חיזבאללה
            , תוך זמן קצר לוחמי היחידה החלו לקצור הצלחות
            . הכרעה בכל היתקלות ושינוי מאזן הכוחות בדרום לבנון
            . “ארדוף אויבי ואשיגם ולא אשוב עד כלותם…”</p>

            <h1>1996</h1>
            <h2>הקמת סיירת אגוז</h2>
            <p>סיירת אגוז הוקמה לראשונה בשנת 
                1956, כסיירת הפיקודית של פיקוד הצפון בהוראת יצחק רבין ז”ל
                , היחידה נסגרה ב1957 והוקמה מחדש 1963 עד לסגירתה לאחר מלחמת יום הכיפורים. </p>

            <h1>2015</h1>
            <h2>הצטרפות לחטיבת הקומנדו</h2>
            <p>חטיבת עֹוז (חטיבה 89), הידועה יותר בכינוי חטיבת הקומנדו
                , היא חטיבת חיל רגלים למבצעים מיוחדים של זרוע היבשה בצה”ל
                . החטיבה מאגדת תחתיה שלוש יחידות קומנדו – אגוז, מגלן ודובדבן.</p>
        </div>

       
    );
}

